CFD/WindTunnel_CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

UValue          uniform (0 13.4 0); /* About 30 mph */

internalField   ${UValue};
 
boundaryField
{
    inlet
    {
        type            fixedValue;
        value      ${UValue}; 
    }
    outlet
    {
        type            zeroGradient;
    }
    IBF_snappyHexMesh
    {
        type            noSlip;
    }
    ".*Wall"
    {
        // type            freestream;
        // freestreamValue ${UValue};
        type            slip;
    }
}

// ************************************************************************* //