CFD/WindTunnel_CFD/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

// omegaValue      uniform 2.85;
omegaValue      uniform 133.2;  

internalField   ${omegaValue};

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           ${omegaValue};
    }
    outlet
    {
        type            freestream;
        freestreamValue  ${omegaValue}; 
    }
    IBF_snappyHexMesh
    {
        type            omegaWallFunction;
        value           ${omegaValue}; // Initial guess, wall function will override
    }
    ".*Wall"
    {
        // type            freestream;
        // freestreamValue ${omegaValue}; 
        type             zeroGradient;
    }
}
// ************************************************************************* //