CFD/WindTunnel_CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }
    IBF_snappyHexMesh
    {
        type            zeroGradient;
    }
    ".*Wall"
    {
        // type            freestreamPressure;
        // freestreamValue uniform 0;
        type            zeroGradient;
    }
}

// ************************************************************************* //