CFD/WindTunnel_CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          simpleFoam;

startFrom       latestTime; /* Set to latestTime if we want to pause and resume*/

// startTime       0;

stopAt          endTime;

endTime         2; /* Run for n seconds */

deltaT          0.001;

adjustTimeStep  true;

maxCo           0.5;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      200; /* For IBF it's about 250mb per file, so cap at 50gb stored*/

writeFormat     binary; /* Use binary to conserve storage*/

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true; /* This allows for modification in the middle of a run */

/*
The best way to get lift and drag coefficients (C_L and C_D) from a simulation in OpenFOAM is 
to use the forceCoeffs function object. This tool is designed specifically for this purpose 
and automatically calculates the coefficients during the simulation.

Setting up forceCoeffs
To enable the forceCoeffs function object, you need to add a block to 
your system/controlDict file. Here is an example of what that block looks like:
*/

functions
{
  #include "functions/forceCoeffs.cfg"
  #include "functions/wallShearStress.cfg"
}

// ************************************************************************* //
