CFD/WindTunnel_CFD/system/functions/forceCoeffs.cfg
forceCoeffs1
{
  type            forceCoeffs;
  libs            ("libforces.so");
  patches         (IBF_snappyHexMesh); 
  log             true;

  // Reference values for coefficient calculation
  rho             rhoInf;
  rhoInf          1.225; // Density of air in kg/m^3
  magUInf         13.4; // Free-stream velocity in m/s
  
  // Reference area and length
  Aref            1.0; // Reference area in m^2 (e.g., wing planform area)
  lRef            1.0; // Reference length in m (e.g., wing chord)
  
  // Coordinate system for forces
  liftDir         (0 0 1);  // Direction of lift 
  dragDir         (0 1 0);  // Direction of drag 
  
  // Center of rotation for moments
  CofR            (0 0.175 0); // Center of rotation for moment calculations
}