CFD/WindTunnel_CFD/system/functions/wallShearStress.cfg
wallShearStress1
{
    type            wallShearStress;
    libs            ("libfieldFunctionObjects.so");
    patches         (IBF_snappyHexMesh); 
    log             true;
    
    // Optional settings
    writeControl    timeStep;
    writeInterval   1;
}