CFD/WindTunnel_CFD/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       5e-07;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|k|omega)"
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance       1e-07;
        relTol          0.1;
        limit           1.0;
    }
    
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    pRefCell       0;
    pRefValue      0;
}

relaxationFactors
{
    fields
    {
        p               0.2;
    }

    equations
    {
        U               0.5;
        k               0.1;
        omega           0.1;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //